In [63]:
import numpy as np
import pandas as pd

A = pd.DataFrame(np.random.rand(3,3), columns = list('ABC'))
B = pd.DataFrame(np.random.rand(3,3), columns = list('ABD'))

In [64]:
A

          A         B         C
0  0.027437  0.519936  0.471273
1  0.027673  0.188245  0.712867
2  0.454094  0.996385  0.423131

In [65]:

S = pd.Series(np.arange(1,4), index=list('ABD'))

In [66]:
S

A    1
B    2
D    3
dtype: int64

In [67]:
A-S

          A         B   C   D
0 -0.972563 -1.480064 NaN NaN
1 -0.972327 -1.811755 NaN NaN
2 -0.545906 -1.003615 NaN NaN

In [68]:
A.sub(B, fill_value = 0)

          A         B         C         D
0 -0.764852  0.252692  0.471273 -0.087125
1 -0.125992 -0.464560  0.712867 -0.208920
2 -0.260766  0.488892  0.423131 -0.316194

In [69]:
A.iloc[0,2]

0.4712732193655046

In [70]:
A.iloc[0:3,0:3]

          A         B         C
0  0.027437  0.519936  0.471273
1  0.027673  0.188245  0.712867
2  0.454094  0.996385  0.423131

In [71]:
A.loc[0:1,'A':'B'] = B.loc[1:2,'B':'C']

In [72]:
A

          A         B         C
0       NaN       NaN  0.471273
1       NaN  0.652805  0.712867
2  0.454094  0.996385  0.423131

In [73]:
B

          A         B         D
0  0.792289  0.267244  0.087125
1  0.153665  0.652805  0.208920
2  0.714860  0.507493  0.316194

In [77]:
A.iloc[0:2,0:2] = B.iloc[1:3,1:3]

In [78]:
A

          A         B         C
0       NaN       NaN  0.471273
1       NaN  0.652805  0.712867
2  0.454094  0.996385  0.423131